api_svr/app/controllers/application_controller.rb

  def authorize_request

    header = request.headers['Authorization']
    header = header.split(' ').last if header
    begin
      @decoded = JsonWebToken.decode(header)
      logger.debug("--------------- Decoded")
      logger.debug(@decoded)
      logger.debug("User ID " + @decoded[:user_id].to_s)
      logger.debug("Franchise ID" + @decoded[:franchise_id].to_s)
      @current_user = User.find(@decoded[:user_id])

      @franchise = Franchise.find(@decoded[:franchise_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]