api_svr/app/controllers/authentication_controller.rb

SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "admin@nodehealth.com"], ["LIMIT", 1]]
---
    def login
      logger.debug(params)
      @user = User.find_by_email(params[:email])