api_svr/app/controllers/franchises_controller.rb

    def index
        @franchises = Franchise.all
---
SELECT "franchises".* FROM "franchises"