api_svr/app/controllers/geolayers_controller.rb

    def index
        @franchise=self.get_franchise()
        @geolayers = @franchise.geolayers.all
---
SELECT "geolayers".* FROM "geolayers"

    def show
        @geolayer = Geolayer.find(params[:id])
---
SELECT "geolayers".* FROM "geolayers" WHERE "geolayers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def create
        logger.debug("CREATE!")
        @franchise=Franchise.find(params[:franchise_id])
        @geolayer = @franchise.geolayers.new(
            name: params[:name],
            enabled: true,
            layer_type: params[:layer_type],
            source: params[:source],
            uri: params[:uri],
            filter: params[:filter]

        )
        if @geolayer.save
---
SELECT "franchises".* FROM "franchises" WHERE "franchises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "franchises" ("name", "full_name", "contact_email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "TestOrg"], ["full_name", "TestOrg corp."], ["contact_email", "bob@gmail.com"], ["created_at", "2022-04-22 00:45:26.621615"], ["updated_at", "2022-04-22 00:45:26.621615"]]