api_svr/app/controllers/users_controller.rb

INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
    def create
      logger.debug("DEBUGGING")
      logger.debug(params)
      logger.debug(user_params)
      @user = User.new(user_params)
      if @user.save